<a href="https://colab.research.google.com/github/mandem296/SQLite-Chinook/blob/main/SQL_%26_PowerBi_Challenges.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **CHALLENGES**

## **Week 1 Daily Challenges**

### **Day 1: Develop database called ABC_DATA and use it to store:**

*   Customer info
*   Customer orders
*   Product info
*   Order Info

In [2]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 44.8/44.8 kB 1.6 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.0

In [3]:
%load_ext sql

In [4]:
#Creating the database
%sql sqlite:///ABC_DATA.db

In [5]:
#creating the customers info table

%%sql

CREATE TABLE customers_info (
  customer_id integer PRIMARY KEY,
  customer_first_name varchar(100),
  customer_last_name varchar(100),
  customer_email varchar(100)
);

 * sqlite:///ABC_DATA.db
Done.

[]

In [7]:
#creating the products table

%%sql

CREATE TABLE products (
  product_id integer PRIMARY KEY,
  product_name varchar(100),
  price float(2)
);

 * sqlite:///ABC_DATA.db
Done.

[]

In [11]:
#creating the orders table

%%sql

CREATE TABLE orders (
  order_id integer PRIMARY KEY,
  customer_id integer,
  order_date DATE
);

 * sqlite:///ABC_DATA.db
Done.

[]

In [14]:
#creating the Order_items table

%%sql

CREATE TABLE order_items (
  order_id integer,
  product_id integer,
  quantity integer
);

 * sqlite:///ABC_DATA.db
Done.

[]

In [15]:
#Listing all column names in a particular table. We are looking at the schema

%%sql

PRAGMA table_info(customers_info)

 * sqlite:///ABC_DATA.db
Done.

[(0, 'customer_id', 'INTEGER', 0, None, 1),
 (1, 'customer_first_name', 'varchar(100)', 0, None, 0),
 (2, 'customer_last_name', 'varchar(100)', 0, None, 0),
 (3, 'customer_email', 'varchar(100)', 0, None, 0)]

In [16]:
#Listing all column names in a particular table. We are looking at the schema

%%sql

PRAGMA table_info(products)

 * sqlite:///ABC_DATA.db
Done.

[(0, 'product_id', 'INTEGER', 0, None, 1),
 (1, 'product_name', 'varchar(100)', 0, None, 0),
 (2, 'price', 'float(2)', 0, None, 0)]

In [17]:
#Listing all column names in a particular table. We are looking at the schema

%%sql

PRAGMA table_info(orders)

 * sqlite:///ABC_DATA.db
Done.

[(0, 'order_id', 'INTEGER', 0, None, 1),
 (1, 'customer_id', 'INTEGER', 0, None, 0),
 (2, 'order_date', 'DATE', 0, None, 0)]

In [18]:
#Listing all column names in a particular table. We are looking at the schema

%%sql

PRAGMA table_info(order_items)

 * sqlite:///ABC_DATA.db
Done.

[(0, 'order_id', 'INTEGER', 0, None, 0),
 (1, 'product_id', 'INTEGER', 0, None, 0),
 (2, 'quantity', 'INTEGER', 0, None, 0)]

In [19]:
#shows tables contained in the Chinook Database
%%sql
SELECT name FROM sqlite_master WHERE type IN ('table','view') AND name NOT LIKE 'sqlite_%' ORDER BY 1

 * sqlite:///ABC_DATA.db
Done.

[('customers_info',), ('order_items',), ('orders',), ('products',)]

### **Day 2: Develop database called ABC_DATA and use it to store:**

*   Customer info
*   Customer orders
*   Product info
*   Order Info